In [8]:
import pandas as pd

In [9]:
dfs = pd.read_csv("Sales.csv")

In [10]:
dfs

   Order_ID   Product     Category  Quantity  Price  Order_Date
0       101  Keyboard  Electronics         2   1200  2022-06-10
1       102     Mouse  Electronics         3    800  2022-06-12
2       103     Chair    Furniture         1   2500  2022-06-15
3       104     Table    Furniture         2   4000  2022-06-18
4       105    Laptop  Electronics         1  55000  2022-06-20
5       106       Pen   Stationery        10     20  2022-06-25

In [11]:
dfs["Total_amount"] = (dfs["Quantity"] * dfs["Price"])

In [12]:
dfs

   Order_ID   Product     Category  Quantity  Price  Order_Date  Total_amount
0       101  Keyboard  Electronics         2   1200  2022-06-10          2400
1       102     Mouse  Electronics         3    800  2022-06-12          2400
2       103     Chair    Furniture         1   2500  2022-06-15          2500
3       104     Table    Furniture         2   4000  2022-06-18          8000
4       105    Laptop  Electronics         1  55000  2022-06-20         55000
5       106       Pen   Stationery        10     20  2022-06-25           200

In [13]:
[dfs.groupby("Category")["Quantity"].sum()]

[Category
 Electronics     6
 Furniture       3
 Stationery     10
 Name: Quantity, dtype: int64]

In [14]:
dfs.sort_values(by = "Price", ascending = False).head(3)

   Order_ID Product     Category  Quantity  Price  Order_Date  Total_amount
4       105  Laptop  Electronics         1  55000  2022-06-20         55000
3       104   Table    Furniture         2   4000  2022-06-18          8000
2       103   Chair    Furniture         1   2500  2022-06-15          2500